Revit 2024 API
ParameterTypeId.SteelElemWeldDoubleSurfaceshape Property
 "Double Surface Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemWeldDoubleSurfaceshape { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemWeldDoubleSurfaceshape As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemWeldDoubleSurfaceshape {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace